/**
 * 统一错误代码定义
 */
export const ErrorCodeMap = {
  // 10000 - 99999 业务操作错误
  // 用户模块
  10000: '参数校验异常',
  10001: '系统用户未注册',
  10002: '填写验证码有误',
  10003: '用户名密码有误',
  10004: '用户账号已存在！',
  10005: '',
  10006: '',
  10007: '旧密码与原密码不一致',
  10008: '',
  10009: '',
  10010: '',
  10015: '',
  10011: '',
  10012: '',
  10013: '',
  10014: '',
  10016: '',
  10017: '',
  10018: '',
  10019: '',
  10020: '',
  10021: '',
  10101: '',
  10102: '',

  // token相关
  11001: '登录无效或无权限访问',
  11002: '登录身份已过期',
  11003: '无权限，请联系管理员申请权限',

  // OSS相关
  20001: '当前创建的文件或目录已存在',
  20002: '无需操作',
  20003: '已超出支持的最大处理数量',

  // 数据库相关
  30001: '数据库操作失败',
};
